### 전처리 : 특성 공학 기법 사용

In [1]:
import pandas as pd
df_TOCC = pd.read_csv('../../datasets/TypeOfContractChannel.csv')
df_TOCC[:3]

,id,type_of_contract,type_of_contract2,channel,datetime,Term,payment_type,product,amount,state,overdue_count,overdue,credit rating,bank,cancellation,age,Mileage
0,66758234,렌탈,Normal,서비스 방문,2019-10-20,60,CMS,K1,96900,계약확정,0,없음,9.0,새마을금고,정상,43.0,1862.0
1,66755948,렌탈,Extension_Rental,서비스 방문,2019-10-20,60,카드이체,K1,102900,계약확정,0,없음,2.0,현대카드,정상,62.0,2532.0
2,66756657,렌탈,Normal,홈쇼핑/방송,2019-10-20,60,CMS,K1,96900,계약확정,0,없음,8.0,우리은행,정상,60.0,2363.0

### 결측치
- 결측치 확인 : df.isnull().sum()
- 결측치 치환 : 대표값 또는 knn(머신러닝 한 종류)
- 결측치 삭제

In [2]:
df_TOCC.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51304 entries, 0 to 51303
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 51304 non-null  int64
 1   type_of_contract   51300 non-null  object
 2   type_of_contract2  51303 non-null  object
 3   channel            51304 non-null  object
 4   datetime           51304 non-null  object
 5   Term               51304 non-null  int64
 6   payment_type       51304 non-null  object
 7   product            51303 non-null  object
 8   amount             51304 non-null  int64
 9   state              51304 non-null  object
 10  overdue_count      51304 non-null  int64
 11  overdue            51302 non-null  object
 12  credit rating      42521 non-null  float64
 13  bank               48544 non-null  object
 14  cancellation       51279 non-null  object
 15  age                40509 non-null  float64
 16  Mileage            40509 non-null  float64
dtypes: float64(3), int64(4), object(10)
memory usage: 6.7+ MB

In [7]:
df_TOCC.isnull().sum()

id                       0
type_of_contract         4
type_of_contract2        1
channel                  0
datetime                 0
Term                     0
payment_type             0
product                  1
amount                   0
state                    0
overdue_count            0
overdue                  2
credit rating         8783
bank                  2760
cancellation            25
age                  10795
Mileage              10795
dtype: int64

In [9]:
df_TOCC_dropna = df_TOCC.dropna()

In [10]:
df_TOCC_dropna.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 40480 entries, 0 to 51303
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 40480 non-null  int64
 1   type_of_contract   40480 non-null  object
 2   type_of_contract2  40480 non-null  object
 3   channel            40480 non-null  object
 4   datetime           40480 non-null  object
 5   Term               40480 non-null  int64
 6   payment_type       40480 non-null  object
 7   product            40480 non-null  object
 8   amount             40480 non-null  int64
 9   state              40480 non-null  object
 10  overdue_count      40480 non-null  int64
 11  overdue            40480 non-null  object
 12  credit rating      40480 non-null  float64
 13  bank               40480 non-null  object
 14  cancellation       40480 non-null  object
 15  age                40480 non-null  float64
 16  Mileage            40480 non-null  float64
dtypes: float64(3), int64(4), object(10)
memory usage: 5.6+ MB

In [14]:
df_TOCC.dropna(subset=["bank"]).info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48544 entries, 0 to 51303
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 48544 non-null  int64
 1   type_of_contract   48540 non-null  object
 2   type_of_contract2  48543 non-null  object
 3   channel            48544 non-null  object
 4   datetime           48544 non-null  object
 5   Term               48544 non-null  int64
 6   payment_type       48544 non-null  object
 7   product            48543 non-null  object
 8   amount             48544 non-null  int64
 9   state              48544 non-null  object
 10  overdue_count      48544 non-null  int64
 11  overdue            48542 non-null  object
 12  credit rating      42519 non-null  float64
 13  bank               48544 non-null  object
 14  cancellation       48519 non-null  object
 15  age                40507 non-null  float64
 16  Mileage            40507 non-null  float64
dtypes: float64(3), int64(4), object(10)
memory usage: 6.7+ MB

### 이상치 : 사분위 외의 값
- Q1 * 1.5 | Q3 * 1.5 밖의 값

In [18]:
df_TOCC[['age']].describe()

                age
count  40509.000000
mean      46.608285
std       13.465977
min       20.000000
25%       37.000000
50%       46.000000
75%       56.000000
max      107.000000

In [24]:
# Q1, Q3 구함
Q1 = df_TOCC['age'].describe()['25%']
Q3 = df_TOCC['age'].describe()['75%']
IQR = Q3 - Q1

In [25]:
Q1, Q3, IQR

(37.0, 56.0, 19.0)

In [30]:
bound_up = Q3 + IQR * 1.5
bound_up

84.5

In [29]:
bound_down = Q1 - IQR * 1.5
bound_down

8.5

In [31]:
# filter
condition = (df_TOCC['age'] <= bound_up) # 긍정 조건 변환
condition

0         True
1         True
2         True
3         True
4         True
         ...
51299    False
51300     True
51301     True
51302     True
51303     True
Name: age, Length: 51304, dtype: bool

In [33]:
df_TOCC_condition = df_TOCC[condition]